{
	"home": {
		"title": "Gonzalo Valdez",
		"subtitle": "Desarrollador Full-Stack",
		"button": "Ver Mi Trabajo"
	},
	"projects": {
		"title": "Mis Proyectos",
		"stack": "Mi Stack Tecnológico",
		"projectData": [
			{
				"title": "QRico (ERP de Restaurantes)",
				"description": "Un sistema de pedidos de autoservicio con actualizaciones en tiempo real y editor de menús personalizado.",
				"preview": "/videos/RestERP.mp4",
				"tech": ["Next.js", "React", "PostgreSQL", "AWS Lambda", "AWS Amplify", "Tailwind"],
				"fullDescription": "Características principales:\n\n- Sistema de gestión multi-restaurante.\n- Creación de menús dinámicos con opciones anidadas y alérgenos.\n- Notificaciones de pedidos en tiempo real mediante WebSockets.\n- Editor de disposición de mesas y gestión de zonas.\n- Gestión de personal y roles con control de acceso detallado.\n- Despliegue seguro en la nube con arquitectura serverless."
			},
			{
				"title": "ERP Médico CPB",
				"description": "ERP para ventas de equipos médicos, seguimiento de inventario y automatización de flujos de trabajo.",
				"preview": "/videos/CPB.mp4",
				"tech": ["Next.js", "React", "MongoDB", "Tailwind", "AWS Amplify"],
				"fullDescription": "Características principales:\n\n- Seguimiento completo de inventario y equipos médicos.\n- Automatización de flujos de ventas y gestión de pedidos.\n- Control de acceso basado en roles para empleados y administradores.\n- Informes y análisis detallados para decisiones empresariales.\n- Integración fluida con servicios en la nube para fiabilidad y escalabilidad.\n- Interfaz intuitiva para operaciones diarias eficientes."
			},
			{
				"title": "Aplicación de Chat en Grupo",
				"description": "Plataforma de mensajería en tiempo real construida con Express.js, con salas de chat en vivo, gestión de usuarios e interfaz simple usando HTML, CSS y JavaScript puro.",
				"preview": "/videos/Chat.mp4",
				"tech": ["Express.js", "HTML", "CSS", "JavaScript"],
				"fullDescription": "Funciones principales:\n\n- Crear y gestionar chats grupales fácilmente.\n- Generar codigos de invitación de un solo uso para acceso seguro.\n- Asignar o quitar roles de administrador en los grupos.\n- Expulsar o eliminar miembros cuando sea necesario.\n- Interfaz sencilla enfocada en la colaboración grupal."
			}
		]
	}
}
